### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [6]:
# Dependencies and Setup
import pandas as pd
import numpy as np
# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"
# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [7]:
purchase_data_unique = purchase_data.drop_duplicates('Item ID')
purchase_data_unique = purchase_data_unique.drop(['SN', 'Age', 'Gender'], axis=1)

## Player Count

* Display the total number of players

In [8]:
playersdf = purchase_data.drop_duplicates('SN')
player_data = playersdf[['SN', 'Age', 'Gender']]
player_data= player_data.reset_index(drop=True)
player_data

                 SN  Age                 Gender
0           Lisim78   20                   Male
1       Lisovynya38   40                   Male
2        Ithergue48   24                   Male
3     Chamassasya86   24                   Male
4         Iskosia90   23                   Male
5           Yalae81   22                   Male
6         Itheria73   36                   Male
7       Iskjaskst81   20                   Male
8         Undjask33   22                   Male
9       Chanosian48   35  Other / Non-Disclosed
10        Inguron55   23                   Male
11     Haisrisuir60   23                   Male
12     Saelaephos52   21                   Male
13      Assjaskan73   22                   Male
14      Saesrideu94   35                   Male
15        Lisassa64   21                 Female
16        Lisirra25   20                   Male
17        Zontibe81   21                   Male
18        Reunasu60   22                 Female
19        Chamalo71   30                   Male
20     Iathenudil29   20                   Male
21    Phiarithdeu40   20                   Male
22     Siarithria38   38  Other / Non-Disclosed
23         Eyrian71   40                   Male
24          Siala43   30                   Male
25        Lisirra87   29                   Male
26       Lirtossa84   11                   Male
27          Eusri44    7                   Male
28           Aela59   21                   Male
29          Tyida79   24                   Male
..              ...  ...                    ...
546    Chanosiaya39   44                   Male
547       Assylla81   20                   Male
548       Aidaira26   30                   Male
549        Eudanu84   22                 Female
550      Chamiman85   20                   Male
551     Tyialisti80   23                   Male
552       Marundi65   22                   Male
553         Eusur90   36                   Male
554   Mindirranya33   35                   Male
555    Phiallylis33   19                   Male
556          Isty55   20                   Male
557     Frichilsa31   15                   Male
558      Chanista95   39                   Male
559      Aellyria80   23                   Male
560   Rastynusuir31   20                   Male
561        Iljask75   22                   Male
562     Lisjaskan36   11                   Male
563   Mindjasksya61   17                   Male
564  Frichirranya75   36                   Male
565         Ilast79   20                   Male
566       Eratiel90   18                   Male
567         Assim27   45                   Male
568         Irith83   18                   Male
569       Ilosian36   15                   Male
570    Iskossasda43   16                   Male
571          Hala31   21                   Male
572      Jiskjask80   11                   Male
573      Aethedru70   21                 Female
574      Yathecal72   20                   Male
575         Sisur91    7                   Male

[576 rows x 3 columns]

In [9]:
print("Total Players: ", len(player_data))

Total Players:  576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [11]:
unique_items = purchase_data['Item ID'].nunique()

In [12]:
total_rev = purchase_data['Price'].sum()

In [13]:
npurchases = purchase_data['Purchase ID'].nunique()

In [14]:
avg_price = (total_rev/npurchases).round(2)

In [15]:
d = {'Unique Items': [unique_items], 'Average Price': [avg_price], 
     'Number of Purchases': [npurchases], 'Total Revenue': [total_rev]}
summarydf = pd.DataFrame(data=d)
summarydf

   Unique Items  Average Price  Number of Purchases  Total Revenue
0           183           3.05                  780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [16]:
gender_data = player_data['Gender'].value_counts()

In [17]:
genderdf = pd.DataFrame(gender_data)

In [18]:
genderdf['pct'] = ((genderdf['Gender']/len(player_data))*100).round(2)
genderdf

                       Gender    pct
Male                      484  84.03
Female                     81  14.06
Other / Non-Disclosed      11   1.91


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [19]:
female_purchase = purchase_data[purchase_data['Gender'] == 'Female']

In [20]:
purchase_count_f = len(female_purchase)

In [21]:
total_purchase_f = female_purchase['Price'].sum()

In [22]:
avg_purchase_f = (total_purchase_f/purchase_count_f).round(2)

In [23]:
avg_purchase_per_f = (total_purchase_f/len(female_purchase['SN'].unique())).round(2)

In [24]:
male_purchase = purchase_data[purchase_data['Gender'] == 'Male']

In [25]:
purchase_count_m = len(male_purchase)

In [26]:
total_purchase_m = male_purchase['Price'].sum()

In [27]:
avg_purchase_m = (total_purchase_m/purchase_count_m).round(2)

In [28]:
avg_purchase_per_m = (total_purchase_m/len(male_purchase['SN'].unique())).round(2)

In [29]:
other_purchase = purchase_data[purchase_data['Gender'] == 'Other / Non-Disclosed']

In [30]:
purchase_count_o = len(other_purchase)

In [31]:
total_purchase_o = other_purchase['Price'].sum()

In [32]:
avg_purchase_o = (total_purchase_o/purchase_count_o).round(2)

In [33]:
avg_purchase_per_o = (total_purchase_o/len(other_purchase['SN'].unique())).round(2)

In [34]:
purchase_summary_df = {'Gender': ['Female', 'Male', 'Other / Non-Disclosed'],
                      'Purchase Count': [purchase_count_f, purchase_count_m, purchase_count_o],
                      'Average Purchase Price': [avg_purchase_f, avg_purchase_m, avg_purchase_o],
                      'Total Purchase Value': [total_purchase_f, total_purchase_m, total_purchase_o],
                      'Average Total Purchase Price per Person': [avg_purchase_per_f, avg_purchase_per_m, avg_purchase_per_o]}
purchase_summary_df = pd.DataFrame(data=purchase_summary_df)
purchase_summary_df.set_index('Gender')

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase Price per Person
Gender,,,,
Female,113,3.20,361.94,4.47
Male,652,3.02,1967.64,4.07
Other / Non-Disclosed,15,3.35,50.19,4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [35]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]
labels = ['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+']

In [36]:
player_data['Age group'] = pd.cut(player_data['Age'], bins, labels=labels)

In [37]:
AgeData = player_data.groupby('Age group').count()

In [38]:
AgeData = AgeData.rename(columns={'SN':'Total count'})

In [39]:
AgeData = AgeData.drop(['Age', 'Gender'], axis=1)

In [40]:
AgeData['Percent of Players'] = ((AgeData['Total count']/len(player_data))*100).round(2)
AgeData

           Total count  Percent of Players
Age group
<10                 17                2.95
10-14               22                3.82
15-19              107               18.58
20-24              258               44.79
25-29               77               13.37
30-34               52                9.03
35-39               31                5.38
40+                 12                2.08

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [41]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]
labels = ['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+']

In [42]:
purchase_data['Age group'] = pd.cut(purchase_data['Age'], bins, labels=labels)
#PlayerData = player_data.drop('age_group', axis=1)
purchase_data_count = purchase_data.groupby('Age group').count()

In [43]:
purchase_summary = purchase_data.groupby('Age group').sum()
purchase_data_price = purchase_data.drop(['SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Purchase ID'], axis=1)

In [44]:
purchase_summary = purchase_data_price.groupby('Age group').sum()

In [45]:
purchase_summary = purchase_summary.rename(columns={'Price':'Total Purchase Value'})

In [46]:
purchase_summary['Average Purchase Price'] = purchase_data_price.groupby('Age group').mean().round(2)

In [47]:
purchase_summary['Average Total Purchase per Person'] = (purchase_summary['Total Purchase Value']/AgeData['Total count']).round(2)

In [48]:
purchase_summary['Purchase count'] = purchase_data_count['Purchase ID']
purchase_analysis = purchase_summary[['Purchase count', 'Average Purchase Price', 
                                      'Total Purchase Value', 'Average Total Purchase per Person']]
purchase_analysis

,Purchase count,Average Purchase Price,Total Purchase Value,Average Total Purchase per Person
Age group,,,,
<10,23,3.35,77.13,4.54
10-14,28,2.96,82.78,3.76
15-19,136,3.04,412.89,3.86
20-24,365,3.05,1114.06,4.32
25-29,101,2.90,293.00,3.81
30-34,73,2.93,214.00,4.12
35-39,41,3.60,147.67,4.76
40+,13,2.94,38.24,3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [49]:
top_spenders = purchase_data.groupby('SN').sum()

In [50]:
top_spenders_count = purchase_data.groupby('SN').count()

In [51]:
top_spenders['Purchase Count'] = top_spenders_count['Purchase ID']
top_spenders['Total Purchase Value'] = top_spenders['Price']
top_spenders['Average Purchase Price'] = (top_spenders['Total Purchase Value']/top_spenders['Purchase Count']).round(2)
top_spenders_summary = top_spenders[['Purchase Count', 'Average Purchase Price', 'Total Purchase Value']]
top_spenders_summary = top_spenders_summary.sort_values(by=['Total Purchase Value'], ascending=False)
top_spenders_summary.head(5)

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                    3.79                 18.96
Idastidru52               4                    3.86                 15.45
Chamjask73                3                    4.61                 13.83
Iral74                    4                    3.40                 13.62
Iskadarya95               3                    4.37                 13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [52]:
Items = purchase_data.sort_values(by=['Item ID'], ascending=False)

In [53]:
Items_unique = Items.drop_duplicates('Item ID')
Items_good = Items_unique.set_index('Item ID')

In [54]:
Items_good = Items_good.drop(['Purchase ID', 'SN', 'Age', 'Gender'], axis=1)

In [55]:
popular_items_Name = Items.groupby(['Item ID', 'Item Name']).count()
popular_items_Name = popular_items_Name.sort_values(by=['Purchase ID'], ascending=False)
popular_items = popular_items_Name.drop(['SN', 'Age', 'Gender', 'Price'], axis=1)

In [56]:
most_popular_items = popular_items.join(Items_good['Price'], on='Item ID')
most_popular_items = most_popular_items.rename(columns={'Purchase ID':'Purchase Count'})

In [57]:
most_popular_items['Total Purchase Value'] = most_popular_items['Purchase Count']*most_popular_items['Price']
#most_popular_items = most_popular_items.sort_values(by=['Purchase Count', 'Item ID'], ascending=False)
most_popular_items.head()

,,Purchase Count,Age group,Price,Total Purchase Value
Item ID,Item Name,,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,12,4.23,50.76
145,Fiery Glass Crusader,9,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,9,3.53,31.77
82,Nirvana,9,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,8,1.02,8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [58]:
most_profitable_items = most_popular_items.sort_values(by=['Total Purchase Value'], ascending=False)
most_profitable_items.head()

,,Purchase Count,Age group,Price,Total Purchase Value
Item ID,Item Name,,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,12,4.23,50.76
82,Nirvana,9,9,4.90,44.10
145,Fiery Glass Crusader,9,9,4.58,41.22
92,Final Critic,8,8,4.88,39.04
103,Singed Scalpel,8,8,4.35,34.80